# Brewfile
#
# Maintained by Robert Romore.
#
# Forked from ByungjinPark <posquit0.bj@gmail.com>
# http://www.posquit0.com/
#
# Modified by Robert Romore

cask_args appdir: "/Applications"

# Install and manage GUI macOS applications
tap "homebrew/cask"
# Alternate versions of Casks
tap "homebrew/cask-versions"
# Integrates Homebrew formulae with macOS" `launchctl` manager
tap "homebrew/services"
# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap "buo/cask-upgrade"

### System {{{
  ## Mac OS X
  # Homebrew GUI App for OS X
  cask "cakebrew"
  # Mac App Store command line interface
  brew "mas"
  # System Utilities for macOS
  cask "onyx"
  # Swiss Army Knife for macOS
  brew "m-cli"

  ## Monitoring
  brew "htop"
  # Display an interface"s bandwidth usage
  brew "iftop"
  # Top-like interface for container metrics
  brew "ctop"
### }}}

### File System {{{
  ## Cloud
  cask "google-drive-file-stream"

  ## Recovery
  # Console program to recover files based on their headers and footers
  brew "foremost"
### }}}

### Web {{{
  ## Web Browser
  cask "google-chrome"
  cask "firefox-developer-edition"

  ## HTTP Request
  # cURL with openssl
  brew "curl"
  # Internet file retriever
  brew "wget"
  # User-friendly cURL replacement (command-line HTTP client)
  brew "httpie"
### }}}

### Video {{{
  ## Player
  # VLC media player
  cask "vlc"
### }}}

### Messaging {{{
  cask "slack"
### }}}

### Network {{{
  ## Analysis
  # The world’s foremost and widely-used network protocol analyzer
  # cask "wireshark"
  # Port scanning utility for large networks
  # brew "nmap"

  ## Proxy & VPN
  # Free software for OpenVPN on OS X
  # cask "tunnelblick"
  # For an instant, secure URL to your localhost server through any NAT or firewall
  cask "ngrok"

  ## Utility
  # MAC spoofing GUI for macOS
  # cask "linkliar"
### }}}

### Utility {{{
  # Install GNU core utilities (those that come with macOS are outdated).
  brew "coreutils"
  # Install some other useful utilities like `sponge`.
  brew "moreutils"
  # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
  brew "findutils"
  # Install GNU `sed`, overwriting the built-in `sed`.
  brew "gnu-sed"
  # Grep
  brew "grep"
  # AWK
  brew "gawk"
  # OpenSSH
  brew "openssh"
  # Nano
  brew "nano"
  # Rsync
  brew "rsync"

  ## Compress/Uncompress
  # 7-Zip (high compression file archiver) implementation
  brew "p7zip"
  # General-purpose data compression with high compression ratio
  brew "xz"

  ## Image compressors
  brew "imageoptim-cli"
  brew "jpegoptim"
  brew "optipng"

  # Command line notifications for long-running processes.
  brew "terminal-notifier"
  # Executes a program periodically, showing output fullscreen
  brew "watch"
  # Simplified and community-driven man pages
  brew "tldr"

  # Boosts your efficiency with hotkeys, keywords, text expansion and more
  # cask "alfred"

  # Organize the menu bar icons
  cask "bartender"

  # A single place for all of your web applications
  # cask "station"

  # Thoroughly uninstalls an application.
  cask "appcleaner"

  # Graphic visualization of largest files on disk.
  cask "disk-inventory-x"

  # Archiving program.
  cask "keka"

  # Hosts file manager.
  cask "gas-mask"

  # Trash
  brew "trash"

  # Mackup
  brew "mackup"
### }}}

### Programming Language {{{
  ## Node.js
  # Platform built on V8 to build network applications
  brew "node"
  # Node version manager
  brew "nvm"

  ## Python
  # Python3
  brew "python"
  # Python dependency management tool
  brew "pipenv"

  ## Shellscript
  # Static analysis and lint tool, for (ba)sh scripts
  brew "shellcheck"

  ## Ruby
  # Powerful, clean, object-oriented scripting language
  brew "ruby"

  # PHP Composer
  brew "composer"
### }}}

### VCS {{{
  ## Git & GitHub
  # Distributed revision control system
  brew "git"
  # Git extension for versioning large files
  brew "git-lfs"
  # Small git utilities
  brew "git-extras"
  # Extensions to follow Vincent Driessen"s branching model
  brew "git-flow"
  brew "git-flow-avh"
  # Prevents you from committing sensitive information to a git repo
  brew "git-secrets"
  # Text interface for Git repositories
  brew "tig"
  # A simple terminal UI for git commands
  tap "jesseduffield/lazygit"
  brew "lazygit"
  # Extend your GitHub workflow beyond your browser <Paste>
  cask "github"
  # Git GUI client
  cask "fork"
  # Great looking diffs
  brew "diff-so-fancy"

  ## ETC
  # Clone of cat with syntax highlighting and Git integration
  brew "bat"
### }}}

### Code Editor & IDE {{{
  ## Editor: Vim
  # Vi "workalike" with many additional features
  brew "vim"
  # GUI for vim, made for macOS
  cask "macvim"
  # Ambitious Vim-fork focused on extensibility and agility
  brew "neovim"

  ## Editor: Microsoft Visual Studio Code
  cask "visual-studio-code"
### }}}

### Terminal {{{
  ## Terminal Emulator
  # Terminal Emulator for macOS
  cask "iterm2"

  ## Terminal Multiplexer
  # Terminal multiplexer with VT100/ANSI terminal emulation
  brew "screen"
  # A terminal multiplexer, allowing to access multiple separate terminal sessions
  # brew "tmux", args: ["with-utf8proc"]
  brew "tmux"
  # Reattach process (e.g., tmux) to background
  brew "reattach-to-user-namespace"

  ## Utility
  # Opens a terminal window to the current directory in Finder
  # INFO: Need to set up manually
  cask "go2shell"
  # Modern replacement for `ls`
  brew "exa"
  # Fuzzy finder
  brew "fzf"
  # Nano editor
  brew "nano"

  ## Shell: Bash
  # Bourne-Again SHell, a UNIX command interpreter
  brew "bash"
  # Programmable completion for Bash 4.1+
  brew "bash-completion@2"

  ## Starship terminal theme
  brew "starship"

  ## Shell: Zsh
  brew "sheldon"
  # UNIX shell (command interpreter)
  # INFO: Need to add `/usr/local/bin/zsh` to `/etc/shells`
  brew "zsh"
  # Tips, tricks, and examples for zsh
  brew "zsh-lovers"
  # zplug
  brew "zplug"
#}}}

### Database {{{
  cask "sequel-ace"
### }}}

### Virtualization {{{
  ## Container
  # Docker Community Edition for Mac (Edge)
  cask "docker-edge"
### }}}

### Development {{{
### }}}

### DevOps {{{
### }}}

### Cryptography {{{
  # SSL/TLS cryptography library
  brew "openssl"

  ## PGP(Pretty Good Privacy)
  # GNU Pretty Good Privacy (PGP) package
  brew "gnupg"
### }}}

### Font {{{
  # XML-based font configuration API for X Windows
  brew "fontconfig"

  # List of available fonts: https://github.com/Homebrew/homebrew-cask-fonts/tree/master/Casks
  ## Font Family: ETC
  cask "homebrew/cask-fonts/font-fira-code"
  cask "homebrew/cask-fonts/font-fira-mono"
### }}}

### Mac Store apps {{{
  # Bear: note taking app.
  # mas "1091189122"
  # Amphetamine: prevent computer from sleeping.
  # mas "Amphetamine", id: 937984704
  # Magnet: window tiling manager.
  # mas "Magnet", id: 441258766
### }}}
